{
  "title": "codcut | Complete IT Services",
  "description": "Provider of comprehensive IT solutions including web and mobile app development, API creation, payment integration, eCommerce platforms, Adobe Experience Manager expertise, full-stack development, agile methodologies, CMS implementations and UI/UX design.",
  "headline": "Provider of IT consulting and services",
  "footer": "{year} All rights reserved",
  "footer_copyrights": "About icons created by Muhammad Ali",
  "not_found": "NOT FOUND",
  "go_home": "Go home",
  "contact": "Contact",
  "contact_1": "Interested in working together? Awesome! Fill the above form with your name, email, and some details about your project. The more you can share, the better we can tailor our services to fit your needs.",
  "contact_2": "Have an app idea? or want to expand your business online? Let's talk!",
  "info": "Info",
  "about": "About",
  "about_title": "Comprehensive IT solutions.",
  "about_title_1": "Expertise & Customization",
  "about_meta_1": "With more than 11 years of experience in providing professional services, our aim is to deliver exceptional solutions that guarantee customer satisfaction and help businesses achieve their goals.",
  "about_title_2": "High-Converting Design",
  "about_meta_2":"Designing and developing landing websites that captivate visitors and improve conversion rates. Create robust e-commerce platforms that streamline online transactions and enhance the customer experience.",
  "about_title_3": "UI/UX & SSO Excellence",
  "about_meta_3": "UI/UX integration, ensuring that your website or application not only looks visually appealing but also provides a seamless user experience. Implementing Single Sign-On (SSO) authentication solutions that enhance security and simplify user access.",
  "about_title_4": "Payment & API Mastery",
  "about_meta_4": "Payment integration, which allows businesses to securely process transactions online. API development that enable seamless data exchange between different software applications, streamlining workflow and boosting efficiency.",
  "about_title_5": "SaaS Innovation",
  "about_meta_5":"Build Software as a Service (SaaS) platforms that provide a scalable and cost-effective solution for delivering software applications to customers.",
  "name": "Name",
  "email": "Email",
  "subject": "Subject",
  "message": "Message...",
  "to": "to",
  "amplify": "amplify",
  "hero_1": "Transforming ideas into digital reality",
  "hero_2": "Crafting tailored IT solutions",
  "hero_3": "your digital presence",
  "hero_4": "From ideation to launch, I provide end-to-end web development services to elevate your brand's online presence.",
  "implemented_projects": "Latest implemented projects.",
  "work": "Work",
  "buktio_title": "Web app Buktio",
  "skyhavoc_title": "Browser game Skyhavoc",
  "babinio_title": "Mobile app Babinio",
  "covermy_title": "Web app CoverMy",
  "brokerfy_title": "Web app Brokerfy",
  "development": "Development",
  "skills": "Skills",
  "message_sent": "Message sent!",
  "contact_confirmation": "Please wait until your request is reviewed.",
  "privacy": "Privacy",
  "work_meta": "Latest implemented projects.",
  "skills_meta": "Proven experience with the following tools",
  "english": "English",
  "romanian": "Romanian",
  "lets_talk": "Let's talk"
}
