{
  "title": "codcut | Servicii IT Complete",
  "description": "Furnizor de soluții IT cuprinzătoare, inclusiv dezvoltare de aplicații web și mobile, creare de API, integrare de plăți, platforme eCommerce, expertiză Adobe Experience Manager, dezvoltare full-stack, metodologii agile, implementări CMS și design UI/UX.",
  "headline": "Furnizor de servicii IT și consultanță",
  "footer": "{year} Toate drepturile rezervate",
  "footer_copyrights": "Icoane create de Muhammad Ali",
  "not_found": "NU A FOST GĂSIT",
  "go_home": "Mergi acasă",
  "contact": "Contact",
  "contact_1": "Vrei să colaborăm? Completează formularul de mai sus cu numele tău, emailul și câteva detalii despre proiectul tău. Cu cât poți să împărtășești mai mult, cu atât mai bine pot să-mi adaptez serviciile la nevoile tale.",
  "contact_2": "Ai o idee de aplicație? sau vrei să îți extinzi afacerea online? Hai să discutăm!",
  "info": "Informații",
  "about": "Domenii de expertiză",
  "about_title": "Soluții IT complexe.",
  "about_title_1": "Expertiză & Personalizare",
  "about_meta_1": "Cu peste 11 ani de experiență în furnizarea de servicii profesionale, scopul meu este să ofer soluții excepționale care garantează satisfacția clienților și ajută afacerile să își atingă obiectivele.",
  "about_title_2": "Design de Înaltă Conversie",
  "about_meta_2": "Proiectarea și dezvoltarea de site-uri web care captivează vizitatorii și îmbunătățesc ratele de conversie. Crearea de platforme robuste de comerț electronic care simplifică tranzacțiile online și îmbunătățesc experiența clienților.",
  "about_title_3": "Excelență în UI/UX & SSO",
  "about_meta_3": "Integrare UI/UX, asigurând că site-ul sau aplicația dvs. nu doar arată atrăgător vizual, ci oferă și o experiență de utilizator fără sudură. Implementarea soluțiilor de autentificare Single Sign-On (SSO) care îmbunătățesc securitatea și simplifică accesul utilizatorilor.",
  "about_title_4": "Plăți & API",
  "about_meta_4": "Integrarea plăților, care permite afacerilor să proceseze tranzacțiile online în mod sigur. Dezvoltarea API care permite schimbul fără probleme de date între diferite aplicații software, optimizând fluxul de lucru și îmbunătățind eficiența.",
  "about_title_5": "Inovație SaaS",
  "about_meta_5": "Construirea platformelor Software ca și Serviciu care oferă o soluție scalabilă și eficientă din punct de vedere al costurilor pentru livrarea aplicațiilor software către clienți.",
  "name": "Nume",
  "email": "Email",
  "subject": "Subiect",
  "message": "Mesaj...",
  "submit": "Trimite",
  "to": "pentru a",
  "amplify": "amplifica",
  "hero_1": "Transformarea ideilor în realitate digitală",
  "hero_2": "Soluții IT personalizate",
  "hero_3": "prezența ta digitală",
  "hero_4": "De la idee la lansare, ofer servicii de dezvoltare web de la cap la coadă pentru a-ți mări prezența online.",
  "implemented_projects": "Cele mai recente proiecte implementate.",
  "work": "Lucru",
  "buktio_title": "Aplicație web Buktio",
  "skyhavoc_title": "Joc pe browser Skyhavoc",
  "babinio_title": "Aplicație mobilă Babinio",
  "covermy_title": "Aplicație web CoverMy",
  "brokerfy_title": "Aplicație web Brokerfy",
  "development": "Dezvoltare",
  "skills": "Aptitudini",
  "message_sent": "Mesaj trimis!",
  "contact_confirmation": "Vă rugăm așteptați până când cererea dvs. este revizuită.",
  "privacy": "Confidențialitate",
  "work_meta": "Cele mai recente proiecte implementate.",
  "skills_meta": "Experiență dovedită cu următoarele instrumente",
  "english": "Engleză",
  "romanian": "Română",
  "lets_talk": "Hai să vorbim"
}
