{
  "title": "codcut | Soluții Digitale Personalizat",
  "description": "Soluții IT personalizate, incluzând dezvoltare de aplicații web și mobile, inginerie API, integrări securizate de plăți, platforme dinamice eCommerce, expertiză Adobe Experience Manager, dezvoltare full-stack, execuție agilă de proiecte, configurări CMS și design UI/UX captivant.",
  "headline": "Consultanță IT de Top și Servicii Digitale Personalizate",
  "footer": "{year} Toate drepturile rezervate",
  "footer_copyrights": "Icoane create de Muhammad Ali",
  "not_found": "NU A FOST GĂSIT",
  "go_home": "Mergi acasă",
  "contact": "Contact",
  "contact_1": "Vrei să colaborăm? Completează formularul de mai sus cu numele tău, emailul și câteva detalii despre proiectul tău. Cu cât poți să împărtășești mai mult, cu atât mai bine pot să-mi adaptez serviciile la nevoile tale.",
  "contact_2": "Ai o idee de aplicație? sau vrei să îți extinzi afacerea online? Hai să discutăm!",
  "info": "Informații",
  "about": "Domenii de expertiză",
  "about_title": "Soluții Digitale de la A la Z.",
  "about_title_1": "Soluții Personalizate",
  "about_meta_1": "Cu peste un deceniu de experiență profesionala, scopul meu este să creez soluții remarcabile care să asigure încântarea clienților și să ajut companiile să își realizeze ambițiile.",
  "about_title_2": "Design Centrat pe Conversii",
  "about_meta_2": "Crearea de pagini de aterizare atractive pentru a îmbunătăți ratele de conversie, alături de platforme robuste de comerț electronic care simplifică tranzacțiile online și îmbogățesc interacțiunea cu clienții.",
  "about_title_3": "Integrare UI/UX & SSO",
  "about_meta_3": "Armonizarea designului UI/UX pentru site-uri web sau aplicații vizual atractive și ușor de utilizat. Implementarea soluțiilor Single Sign-On (SSO) pentru o securitate îmbunătățită și acces facil al utilizatorilor.",
  "about_title_4": "Plăților & API",
  "about_meta_4": "Facilitarea procesării securizate a tranzacțiilor online prin integrări de plată. Dezvoltare API pentru un schimb de date lin între diverse aplicații software, îmbunătățind fluxul de lucru și eficiența operațională.",
  "about_title_5": "Dezvoltare SaaS",
  "about_meta_5": "Crearea de platforme Software as a Service (SaaS) care oferă căi scalabile și cost-eficiente pentru livrarea aplicațiilor software utilizatorilor.",
  "name": "Nume",
  "email": "Email",
  "subject": "Subiect",
  "message": "Mesaj...",
  "submit": "Trimite",
  "to": "pentru a",
  "amplify": "amplifica",
  "hero_1": "Transformarea ideilor în realitate digitală",
  "hero_2": "Soluții IT personalizate",
  "hero_3": "prezența ta digitală",
  "hero_4": "De la idee la lansare, ofer servicii de dezvoltare web de la cap la coadă pentru a-ți mări prezența online.",
  "implemented_projects": "Cele mai recente proiecte implementate.",
  "work": "Lucru",
  "buktio_title": "Aplicație web Buktio",
  "skyhavoc_title": "Joc pe browser Skyhavoc",
  "babinio_title": "Aplicație mobilă Babinio",
  "covermy_title": "Aplicație web CoverMy",
  "brokerfy_title": "Aplicație web Brokerfy",
  "development": "Dezvoltare",
  "skills": "Aptitudini",
  "message_sent": "Mesaj trimis!",
  "contact_confirmation": "Vă rugăm așteptați până când cererea dvs. este revizuită.",
  "privacy": "Confidențialitate",
  "work_meta": "Cele mai recente proiecte implementate.",
  "skills_meta": "Experiență dovedită cu următoarele instrumente",
  "english": "Engleză",
  "romanian": "Română",
  "lets_talk": "Hai să vorbim"
}
